package com.example.qrgrant.ui.screen.rule

import androidx.compose.foundation.layout.Box
import androidx.compose.foundation.layout.fillMaxWidth
import androidx.compose.foundation.layout.padding
import androidx.compose.foundation.lazy.LazyColumn
import androidx.compose.material3.Scaffold
import androidx.compose.material3.Text
import androidx.compose.runtime.Composable
import androidx.compose.ui.Alignment
import androidx.compose.ui.Modifier
import androidx.compose.ui.graphics.Color
import androidx.compose.ui.unit.dp
import androidx.navigation.NavController
import com.example.qrgrant.ui.components.CustomAppbar
import com.example.qrgrant.ui.screen.rule.components.SectionItem
import com.example.qrgrant.ui.theme.PrimaryStyle

@Composable
fun RuleScreen(navController: NavController) {
    Scaffold(
        containerColor = Color.White,
        topBar = { CustomAppbar("利用規約", navController) },
    ) { paddingValues ->
        LazyColumn(
            modifier = Modifier
                .padding(paddingValues)
                .padding(horizontal = 20.dp)
        ) {
            item {
                Box(
                    modifier = Modifier.fillMaxWidth(), contentAlignment = Alignment.Center
                ) {
                    Text(
                        "利用規約",
                        style = PrimaryStyle.bold(25),
                        modifier = Modifier.padding(vertical = 30.dp)
                    )
                }
            }

            item {
                SectionItem(
                    title = "1. はじめに",
                    content = "1.1 この利用規約(以下「本規約」といいます。)は、株式会社デンソーウェーブ(以下「当社」といいます。)が提供する地域クーポン・振興券等の読取・管理用スマートフォンアプリ(以下「本サービス」といいます。)の利用者(対象の地域又は観光を支援するキャンペーンに参画する事業者の従業員等をいい、以下「ユーザー」といいます。)が本サービスを利用する場合の一切の行為に適用されます。\n1.2 本規約は、本サービスの利用条件を定めるものです。ユーザーは、本規約に同意の上、本規約に従い本サービスを利用するものとします。\n1.3 ユーザーは、本サービスを利用することにより、本規約の全ての記載内容について同意いただいたものとみなされます。"
                )
            }

            item {
                SectionItem(
                    title = "2. 定義",
                    content = "2.1 本規約において表記される用語は以下に定義します。\n1) 「本サービス」とは、1.1 項に定義されます。\n2) 「ユーザー」とは、1.1 項に定義されます。\n3) 「コンテンツ」とはテキスト、写真、音声、音楽、その他のサウンド、画像、動画、イメージを含む全ての種類のデータを示します。\n4) 「コンテンツ提供者」とは前号の「コンテンツ」を本サービスに公開し、ユーザーに提供する第三者を示します。"
                )
            }

            item {
                SectionItem(
                    title = "3. 本サービスの対象者と条件",
                    content = "3.1 ユーザーは、本サービスを利用するにあたって、本規約の内容に同意いただいたものとみなします。同意いただけない場合には本サービスを利用することはできません。\n3.2 ユーザーは本サービスを日本国内においてのみ利用することができるものとします。\n3.3 ユーザーが、本サービスを利用する場合、自らの責任と費用で必要な機器やソフトウェア、通信手段等を用意し、それらを適切に設置、操作する必要があります。当社は、当該機器等および機器等の設置、操作等に関して一切の責任を負いませんし、またユーザーが本サービスを利用する為の準備、方法等について提供する義務を負いません。\n3.4 ユーザーは、自らが反社会的勢力またはこれに準ずるもの(以下「反社会的勢力等」といいます。)ではないこと、反社会的勢力等に資金提供もしくはそれに準ずる行為を通じて、反社会的勢力等の維持、運営に協力または関与していないこと、ならびに、反社会的勢力等と交流をもっていないこと、さらに、将来においても、反社会的勢力等と一切関係を持たないことを表明し、保証するものとします。"
                )
            }

            item {
                SectionItem(
                    title = "4. 本サービスの利用期間と使用停止",
                    content = "4.1 ユーザーは、本サービスを対象の地域又は観光を支援するキャンペーンの期間中のみ利用できるものとし、キャンペーン終了後は当社の判断によりいつでも本サービスの利用を停止することができます。\n4.2 ユーザーは、本サービスを利用するモバイル端末から本サービスを削除(アンインストール)することにより、いつでも本サービスの使用を止めることができます。"
                )
            }

            item {
                SectionItem(
                    title = "5. 本サービスの提供条件",
                    content = "5.1 当社は、ユーザーに事前の通知をすることなく、本サービスの内容の全部または一部を変更、追加、削除することができるものとします。当社は、本項に基づく本サービスの変更等によってユーザーに生じた損害につき、一切責任を負いません。\n5.2 当社は、当社が必要と判断した場合、特定のユーザーに対して本サービスの提供を中止することができるものとします。この場合、当社はサービスの提供中止に関しての理由は開示しないものとし、サービスの提供中止に伴う当該ユーザーおよび第三者に対して一切責任を負わないものとします。\n5.3 ユーザーが、本サービスを利用することにおいて生じる通信料金、その他いかなる料金もユーザーの負担となります。ユーザー自身が本サービスにアクセスする為のモバイル端末に関して発生した料金に対して一切の責任を負うものとします。\n5.4 ユーザーは、本規約並びに法律・諸規制・社会常識等に基づき、本サービスを利用することができます。\n5.5 ユーザーは、本サービスの利用および本サービスの利用によってなされた全ての行為、ならびにそれらの結果について責任を負うものとし、本サービスの利用により当社または第三者に対して損害を与えた場合、ユーザー自身の責任と費用をもって賠償および解決等を図るものとします。\n5.6 当社は、本サービス上で、当社が管理をしない外部のウェブサイトやコンテンツに対するリンクを提供することがあります。この場合、当社は、これらのサイトやコンテンツに起因または関連して生じた一切の損害について、直接的であるか、または間接的であるかを問わず、賠償する責任を負わないものとします。"
                )
            }

            item {
                SectionItem(
                    title = "6. 禁止行為",
                    content = "6.1 ユーザーは、本サービスを通じて、次に該当する行為、もしくはその恐れのある行為を行ってはなりません。\n1) 当社もしくは第三者の著作権、意匠権等の知的財産権を侵害する行為。\n2) 本サービスに投稿されているコンテンツ等を、当社およびコンテンツ提供者の同意なく転載する行為。\n3) 当社または第三者の財産、プライバシーもしくは肖像権等を侵害する行為。\n4) 当社または第三者を不当に差別もしくは誹謗中傷し、第三者への不当な差別を助⻑し、またはその名誉もしくは信用を毀損する行為。\n5) 詐称行為。\n6) 詐欺その他の犯罪に関係する行為。\n7) 自らに割り当てられたログイン ID・パスワードを第三者に開示、または使用させる行為。\n8) 他のユーザーに割り当てられたログイン ID・パスワードで本サービスにログインし、本サービスを利用する行為。\n9) 運営者に成りすます行為。\n10) 通常の範囲を超えて本サービスのサーバーに負担をかける行為、または本サービスの運営やネットワーク・システムに支障を与える行為。\n11) 当社の設備に蓄積された情報を不正に書き換え、または消去する行為。\n12) ウィルス等の有害なコンピュータプログラム等を送信または掲載する行為。\n13) 法令、公序良俗もしくは本規約等に違反する行為。\n14) 他者の権利を侵害すると当社が判断する行為。\n15) 本サービスとコンテンツを提供するためのソフトウェアを解読、デコンパイル、分解、リバース・エンジニアリングする行為。\n16) その他、当社が不適切と判断する行為。"
                )
            }

            item {
                SectionItem(
                    title = "7. プライバシー",
                    content = "7.1 当社は、本サービスを通じてユーザーの個人情報を取得、利用、提供することはありません。\n7.2 本サービスを利用いただく際、読み取った QR コードに紐づく個人情報が本サービスの画面上に一時的に表示されることがありますが、当該個人情報は本サービスを通じて当社またはその他第三者に提供されることはありません。"
                )
            }

            item {
                SectionItem(
                    title = "8. コンテンツの著作権",
                    content = "8.1 ユーザーは、本サービスにおけるデザイン、ビジュアルインターフェイス、キャラクター、画像、動画、ソフトウェア、その他本サービスに関する全てのコンテンツの著作権はコンテンツ提供者に帰属し、当社が管理することを了承し、これに同意するものとします。\n8.2 本サービスおよび当社が管理するコンテンツは、個人的、または非営利的目的に限って閲覧を許容します。コンテンツの全部または一部の利用は、本規約において明確に許可されている場合と、別途文書にて当社が許容した場合に限り可能とします。当社が明確に許容する場合以外には、コンテンツの全ての権限は当社またはコンテンツ提供者にあるものとします。\n8.3 ユーザーは、本サービスを利用するにあたって、当社またはコンテンツ提供者の社名、商標、サービスマーク、商号、ロゴ等を使用しないことに同意します。"
                )
            }

            item {
                SectionItem(
                    title = "9. サービス料金", content = "9.1 本サービスは無料となります。"
                )
            }

            item {
                SectionItem(
                    title = "10. 不保証",
                    content = "10.1 当社は、以下の事項を表明または保証しません。\n1) 本サービスの利用がユーザーに必要な事項を満たすこと。\n2) 本サービスの利用に中断が生じず、タイムリーかつ安全であり、またはエラーが生じないこと。\n3) 本サービスの利用を通じて取得した情報が正確であり、または信頼できること。\n4) 本サービスの動作または機能における不具合が修正されること。\n10.2 本サービスの利用を通じて行なったダウンロード、またはその他の方法によるデータ等の取得は、ユーザー自身の裁量および危険負担で行うものであり、ダウンロードの結果生じたユーザーのコンピュータシステムもしくはその他の機器に対する損害またはデータの喪失は、ユーザー自身が一切の責任を負うものとします。\n10.3 媒体を問わず、ユーザーが当社から、もしくは本サービスを通じて取得した情報は、本規約に明示的に定められていない限り当社の保証を何ら生じさせるものではありません。"
                )
            }

            item {
                SectionItem(
                    title = "11. 責任の制限",
                    content = "11.1 ユーザーは、以下の事項について、当社は一切賠償責任を負わないことに同意します。\n1) 本サービスの利用によって生じた損害、または利用ができなかったことによって生じた損害。\n2) 本サービスを通じて取り引きを行う為に費用を要したこと。\n3) ユーザーのデータや通信手段への不正なアクセスや改変。\n4) 本サービス中の第三者によるコメント、発言や行為。\n5) その他本サービスに関連する事項に起因または関連して生じた一切の損害。\n11.2 前項におけるユーザーに対する当社の責任の制限は、当社が、上記損失発生の可能性を認識していたか否かに関わらず適用されるものとします。"
                )
            }

            item {
                SectionItem(
                    title = "12. 本規約の使用言語",
                    content = "12.1 本規約は日本語版を正式版とします。"
                )
            }

            item {
                SectionItem(
                    title = "13. 本規約の適用および変更",
                    content = "13.1 本規約は、本サービスの利用に関し、当社およびユーザーに対し適用されます。また当社が提携または委託した会社が別途利用規約またはこれに相当する規定等を掲載する場合、ユーザーは本規約と同様に従うものとします。\n13.2 当社が別途掲載する個別規定および追加規定は、本規約の一部を構成するものとします。本規約とこれら個別規定または追加規定に矛盾がある場合は、個別規定または追加規定が優先するものとします。\n13.3 本規約と本サービスで定めている事項(ただし前項の個別規定および追加規定は除きます)に矛盾がある場合は、本サービスの定めが優先するものとします。\n13.4 本規約と当社が提携または委託した会社が別途掲載する個別規定または追加規定に矛盾がある場合は、本規約が優先するものとします。\n13.5 当社は、ユーザーへの事前の通知および了承を得ることなく自己の裁量で、適宜、本規約を変更できるものとし、ユーザーはこれを承諾します。本規約を変更する場合、当社は、変更したバーションを作成し、本サービスに掲載します。\n13.6 本規約のいかなる変更も、最新のバージョンを当社ウェブサイトまたは本サービスに掲載した時点で直ちに効力を発するものとします。当社は、ユーザーが当該効力発生時点以降に本サービスを利用する場合には、ユーザーが本規約の最新のバージョンに同意したとみなすものとし、ユーザーは予めこれに同意するものとします。\n13.7 当社は、本規約および個別規定または追加規定の変更に同意できないユーザーに対し、本サービスの利用を停止することができます。"
                )
            }

            item {
                SectionItem(
                    title = "14. 一般的な法的条項",
                    content = "14.1 本規約は、ユーザーと当社との間の完全なる法的な合意を構成し、かつ、ユーザーによる本サービスの利用について定め、かつ、本サービスに関してユーザーと当社との間における従前の合意を完全に代替するものです。\n14.2 ユーザーは、本規約に記載される(または適用法に基づき自らが利益を有する)当社の法律上の権利または救済措置を当社が行使しない、または執行しなかった場合でも、当社はこれら権利を放棄したとみなされないこと、および、かかる権利または救済措置は、当社により引続き利用可能であることについて同意します。\n14.3 本規約に関しいずれかの裁判所が、本規約のいずれかの規定が無効であるとの判決を下した場合には、当該規定は、本規約の残りの規定に影響を及ぼすことなく、本規約から除外されます。本規約の残りの規定は、引続き有効かつ執行可能とします。\n14.4 本規約、および本規約に基づくユーザーと当社との関係は、いかなる場合でも日本国法に準拠するものとし、ユーザーおよび当社は、これらに関連して生じる全ての法的事項について、名古屋地方裁判所を第一審の専属的合意管轄裁判所とすることに同意します。"
                )
            }

            item {
                SectionItem(
                    title = "", content = "2021年4月21日 制定"
                )
            }
        }
    }
}
